propositions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-30 Mon 22:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Propositions</title>
<meta name="generator" content="Org mode" />
<link href="solarized-light.min.css" rel="stylesheet"></link>
</head>
<body>
<div id="content">
<h1 class="title">Propositions</h1>

<div id="outline-container-orgecfa96d" class="outline-2">
<h2 id="orgecfa96d">Cryptographie</h2>
<div class="outline-text-2" id="text-orgecfa96d">
</div>
<div id="outline-container-org521b71f" class="outline-3">
<h3 id="org521b71f">Trustless</h3>
<div class="outline-text-3" id="text-org521b71f">
<p>
Nous ne devrions pas avoir besoin de faire confiance au serveur
pour ne pas lire et analyser nos message.
</p>

<p>
Il devrait donc être impossible à un tiers de lire, ou modifier
notre flux de communication. Pour cela nous utiliseront la cryptographie.
</p>

<p>
Les données chiffrés devraient pouvoir être ouvertes à tous
sans que cela puisse nous compromettre.
</p>
</div>
</div>


<div id="outline-container-orgb3a293a" class="outline-3">
<h3 id="orgb3a293a">Types de messages</h3>
<div class="outline-text-3" id="text-orgb3a293a">
<p>
Chaque utilisateur ayant des besoins spécifiques
</p>

<p>
Nous aurons différent types de messages, par exemple :
</p>

<ul class="org-ul">
<li>En clair: contenu public</li>
<li>Zero: pas de métadata (exemples: bitmessage, minilock)</li>
<li>Direct: Message to public key (M2PK)</li>
<li>Satoshi: Message to public key hash (M2PKH)</li>
</ul>
</div>
</div>


<div id="outline-container-orgec1c296" class="outline-3">
<h3 id="orgec1c296">Types d'adresses</h3>
<div class="outline-text-3" id="text-orgec1c296">
<p>
Chaque utilisateur ayant des besoins spécifiques
</p>

<p>
Nous aurons donc différent types d'adresses, ainsi que
différent types d'encodage.
</p>

<p>
Types d'adresses :
</p>

<ul class="org-ul">
<li>Clé publique</li>
<li>Empreinte de clé publique (ex: SFGAftzSTztFSB8LMwsrdCKTyqGY6zr3sU).
Est plus court qu'une clé publique, et ne la divulgue pas.</li>
<li>Pseudo grace avec un système de 'DNS'</li>
</ul>

<p>
Types d'encodages :
</p>

<ul class="org-ul">
<li>Binary</li>
<li>Base58</li>
<li>Suite de mots (ex: give input convince decide dizzy tag flash spawn)</li>
<li>QR Code</li>
</ul>
</div>
</div>


<div id="outline-container-orgbe179ac" class="outline-3">
<h3 id="orgbe179ac">Comptes (arbres)</h3>
<div class="outline-text-3" id="text-orgbe179ac">
<p>
Nous utiliserons une graine cryptographie comme un arbre infini
générant un flux infini et infiniment dichotomisable d'adresses et de clés.
</p>

<p>
Certaines clés serviront à destocker (en dechiffrant) certaines
informations chiffrés.
</p>

<p>
Certaines clés sont telles quelles des adresse bitcoin, litecoin, etc&#x2026;
</p>

<p>
En partageant une graine cryptographique avec un ami,
il est possible de dériver l'arbre chacun de son coté
et de s'en servir comme clés de chiffrement ou comme points
de rendez vous sans autres négociations.
</p>
</div>
</div>
</div>


<div id="outline-container-orgbbec209" class="outline-2">
<h2 id="orgbbec209">Interfaces</h2>
<div class="outline-text-2" id="text-orgbbec209">
<p>
Nous ne voulons pas limiter le logiciel à une seule interface.
</p>

<p>
Cependant pour simplifier le developpement
il est pratique de proposer une interface standart.
</p>

<p>
Pour répondre au besoin de chacun,
chaque utilisateur devrai avoir la possibilité de
personnaliser son interface. Autant comment il apparait aux autres
que comment les autres lui apparaissent.
</p>

<p>
Les conversations, groupes et événements devraient être
modifiable à deux échelles, globalement et localement (pour chacun).
</p>
</div>
</div>


<div id="outline-container-org1721e7e" class="outline-2">
<h2 id="org1721e7e">Vrac</h2>
<div class="outline-text-2" id="text-org1721e7e">
</div>
<div id="outline-container-org4a05dfd" class="outline-3">
<h3 id="org4a05dfd">Ne pas s'intéresser au transfert ni au stockage des données</h3>
<div class="outline-text-3" id="text-org4a05dfd">
<p>
Il est utile étude de ne s'interesser ni aux mechanismes
de distribution des messages, ni au stockage des messages.
</p>

<p>
Nous nous limitons donc à regarger l'échange
pair-à-pair (peer-to-peer) et de bout-en-bout (end-to-end)
comme si il était toujours possible.
</p>
</div>
</div>


<div id="outline-container-org74309f0" class="outline-3">
<h3 id="org74309f0">Données immutables</h3>
<div class="outline-text-3" id="text-org74309f0">
<p>
Oublier le cas où on peut effacer ou modifier.
</p>

<p>
Nous pourrons ainsi créer plus facilement des hiérarchies de structure.
</p>
</div>
</div>


<div id="outline-container-orge983612" class="outline-3">
<h3 id="orge983612">Optimistic CRDT</h3>
<div class="outline-text-3" id="text-orge983612">
<p>
using resource id and modification time
</p>
</div>
</div>


<div id="outline-container-org3b512cd" class="outline-3">
<h3 id="org3b512cd">Gaussian filter to query the server</h3>
<div class="outline-text-3" id="text-org3b512cd">
<p>
Do not ask the server full addresses
use a filter or just the start of the string
and ask fake addresses on top of it
</p>
</div>
</div>


<div id="outline-container-org0921f0c" class="outline-3">
<h3 id="org0921f0c">Programmed message</h3>
<div class="outline-text-3" id="text-org0921f0c">
<p>
Message we only want to send at a fixed time
</p>
</div>
</div>


<div id="outline-container-org1378afd" class="outline-3">
<h3 id="org1378afd">Systemes</h3>
<div class="outline-text-3" id="text-org1378afd">
</div>
<div id="outline-container-org236f7dd" class="outline-4">
<h4 id="org236f7dd">Systeme 0</h4>
<div class="outline-text-4" id="text-org236f7dd">
<p>
Tous les messages n'inscrive séquentiellement dans une bande de stockage infini
{m0..|m1&#x2026;&#x2026;.|m2|m3..|m4&#x2026;&#x2026;|m5..|&#x2026;..}
Un message ne contient aucune métadata
Tout le monde recoit les messages de tout le monde
Personne ne sait qui parle à qui
</p>
</div>
</div>


<div id="outline-container-org9b1fa1d" class="outline-4">
<h4 id="org9b1fa1d">Systeme 1</h4>
<div class="outline-text-4" id="text-org9b1fa1d">
<p>
message n:
{ destination: user n | content: data }
ou
{ source: user n | content: data }
ou (plus souvent)
{ source: user n | destination: user m | content: data }
Un user peut être représenté par n'importe quoi.
Rien n'est dit sur la possibilité ou non d'impersonnifer quelqu'un (usurpation d'identité). A priori c'est possible.
</p>
</div>
</div>


<div id="outline-container-org0d8d16b" class="outline-4">
<h4 id="org0d8d16b">Systeme 2</h4>
<div class="outline-text-4" id="text-org0d8d16b">
<p>
message n:
{ (source) | (destination) | previous: message m | content }
ou
{ (source) | (destination) | thread<sub>id</sub>: data | content }
Pour simplifier on pourrait garder que le deuxième cas en utilisant si besoin le hash du message précédent comme thread<sub>id</sub>
Les parenthèses signinfie que c'est optionel (soit présent soit absent), soit par système, soit par message dans un système plus global
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-03-30 Mon 22:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
